In [11]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_parquet('../data/processed/application_train.parquet')
df.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [5]:
df['CREDIT_INCOME_RATIO'] =  df['AMT_CREDIT'] / df['AMT_INCOME_TOTAL']

In [6]:
df['ANNUITY_INCOME_RATIO'] = df['AMT_ANNUITY'] / df['AMT_INCOME_TOTAL']

In [7]:
df[['CREDIT_INCOME_RATIO', 'ANNUITY_INCOME_RATIO']]

        CREDIT_INCOME_RATIO  ANNUITY_INCOME_RATIO
0                  2.007889              0.121978
1                  4.790750              0.132217
2                  2.000000              0.100000
3                  2.316167              0.219900
4                  4.222222              0.179963
...                     ...                   ...
307506             1.617143              0.174971
307507             3.743750              0.166687
307508             4.429176              0.195941
307509             2.164368              0.118158
307510             4.285714              0.311857

[307511 rows x 2 columns]

In [9]:
df['DAYS_EMPLOYED'].value_counts()

DAYS_EMPLOYED
 365243    55374
-200         156
-224         152
-230         151
-199         151
           ...
-11471         1
-12878         1
-10573         1
-12990         1
-14184         1
Name: count, Length: 12574, dtype: int64

In [12]:
df['DAYS_EMPLOYED'].apply(lambda x: np.nan if x == 365243 else x)

0         -637.0
1        -1188.0
2         -225.0
3        -3039.0
4        -3038.0
           ...
307506    -236.0
307507       NaN
307508   -7921.0
307509   -4786.0
307510   -1262.0
Name: DAYS_EMPLOYED, Length: 307511, dtype: float64